#include <stdio.h>

int main(void)
{
    int i; // ㅁ

    int arr[5];
    // ㅁㅁㅁㅁㅁ
    // 접근할 때 모습 : arr[0], arr[1], arr[2], arr[3], arr[4]

    int arr2[2][5]; // 5개 짜리가 2개 있는 것.
    // ㅁㅁㅁㅁㅁ
    // ㅁㅁㅁㅁㅁ

    // [0,0][0,1][0,2][0,3][0,4] -> ex) arr2[0][1]
    // [1,0][1,1][1,2][1,3][1,4] -> ex) arr2[1][4]

    int arr3[4][2]; // 두개짜리가 4개 있는 것
    // ㅁㅁ
    // ㅁㅁ
    // ㅁㅁ
    // ㅁㅁ

    int arr4[3][3][3]; // 3개 짜리가 3개 있고 그런 게 3개 있는 것. 총 27개 공간 차지함.
    // ㅁㅁㅁ
    // ㅁㅁㅁ
    // ㅁㅁㅁ

    // ㅁㅁㅁ
    // ㅁㅁㅁ
    // ㅁㅁㅁ

    // ㅁㅁㅁ
    // ㅁㅁㅁ
    // ㅁㅁㅁ

    // [0,0,0][0,0,1][0,0,2] -> ex) arr4[0][0][0]
    // [0,1,0][0,1,1][0,1,2] -> ex) arr4[0][1][2]
    // [0,2,0][0,2,1][0,2,2]

    // [1,0,0][1,0,1][1,0,2]
    // [1,1,0][1,1,1][1,1,2]
    // [1,2,0][1,2,1][1,2,2]

    // [2,0,0][2,0,1][2,0,2]
    // [2,1,0][2,1,1][2,1,2]
    // [2,2,0][2,2,1][2,2,2]




    // 다차원배열 선언과 접근
    int array[5] = {1, 2, 3, 4, 5};
    int array2[2][5] = {
        {1, 2, 3, 4, 5},
        {1, 2, 3, 4, 5}
    };
    int array3[4][2] = {
        {1, 2},
        {3, 4},
        {5, 6},
        {7, 8}
    };

    //접근
    printf("==== array3[4][2] ===\n\n");
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 2; j++)
        {
            printf("array3[%d][%d] = %d\n", i, j, array3[i][j]);
        }
        printf("\n");
    }
    printf("\n\n");

    int array4[3][3][3] = {
        {
            {1, 2, 3},
            {4, 5, 6},
            {7, 8, 9}
        },
        {
            {11, 12, 13},
            {14, 15, 16},
            {17, 18, 19}
        },
        {
            {21, 22, 23},
            {24, 25, 26},
            {27, 28, 29}
        }
    };

    //접근
    printf("==== array4[3][3][3] ===\n\n");
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 3; j++)
        {
            for( int k = 0; k < 3; k++)
            {

                printf("array4[%d][%d][%d] = %d\n", i, j, k,  array4[i][j][k]);
            }
            printf("\n");
        }
        printf("\n");
    }
    printf("\n\n");



    return 0;
}